[
    {"nama": "Keycaps", "deskripsi": "Keycaps adalah tombol-tombol yang ada pada keyboard. Mereka adalah bagian yang kita tekan saat mengetik atau bermain game. Keycaps dapat dibuat dari berbagai jenis bahan, tetapi yang paling umum adalah plastik ABS dan PBT.\n\nABS (Acrylonitrile Butadiene Styrene) adalah jenis plastik yang umum digunakan dalam pembuatan keycaps. Keycaps ABS biasanya memiliki permukaan yang halus dan mengkilap, dan mereka cenderung menjadi lebih mengkilap seiring waktu dan penggunaan.\n\nPBT (Polybutylene Terephthalate) adalah jenis plastik lain yang digunakan dalam pembuatan keycaps. Keycaps PBT biasanya memiliki tekstur yang lebih kasar dibandingkan dengan ABS, dan mereka lebih tahan terhadap efek \"shine\" yang terjadi pada keycaps ABS seiring waktu.\n\nKeycaps juga dapat memiliki berbagai profil, yang merujuk pada bentuk dan ketinggian keycaps. Beberapa profil keycap yang populer termasuk OEM, Cherry, SA, DSA, dan XDA.\nSelain itu, keycaps juga bisa disesuaikan atau \"custom\". Keycaps custom memungkinkan pengguna untuk menyesuaikan tampilan dan nuansa keyboard mereka. Misalnya, Anda dapat membeli keycaps dengan tema tertentu, atau keycaps dengan karakter atau simbol khusus.\n\nSecara umum, keycaps adalah bagian penting dari keyboard yang tidak hanya berfungsi sebagai interface antara pengguna dan perangkat, tetapi juga memberikan estetika dan personalisasi pada keyboard.", "imageId": "fotoinfo/keycap"},
    {"nama": "Keyswitches", "deskripsi": "Switch dalam konteks keyboard adalah mekanisme yang mendaftarkan ketukan tombol atau keypress. Ada beberapa jenis switch yang umum digunakan pada keyboard, terutama pada keyboard mekanik:\n\nSwitch Mekanik: Ini adalah jenis switch yang paling umum ditemukan pada keyboard mekanik. Mereka menggunakan mekanisme fisik untuk mendaftarkan keypress. Ada berbagai jenis switch mekanik, termasuk Cherry MX, Gateron, Kailh, dan lainnya. Masing-masing memiliki karakteristik sendiri-sendiri, seperti tingkat kebisingan, berat keypress, dan umur hidup.\n\nSwitch Membran: Switch ini menggunakan lapisan karet atau silikon yang menciptakan sirkuit ketika tombol ditekan. Mereka biasanya lebih murah dan lebih tenang daripada switch mekanik, tetapi tidak memberikan umpan balik taktis yang sama.\n\nSwitch Topre: Ini adalah jenis switch hybrid yang menggunakan kombinasi dari mekanisme mekanik dan karet. Mereka dikenal karena umpan balik taktis mereka yang memuaskan dan harganya yang relatif mahal.\n\nSwitch Optik: Switch ini menggunakan sinar cahaya untuk mendaftarkan keypress, yang membuatnya sangat cepat dan akurat. Mereka juga cenderung memiliki umur hidup yang lebih lama daripada switch mekanik tradisional.\n\nSwitch Hall Effect: Switch ini menggunakan medan magnet untuk mendaftarkan keypress, yang membuatnya sangat tahan lama dan akurat. Namun, mereka juga cenderung lebih mahal daripada jenis switch lainnya.\n\nPemilihan switch sangat bergantung pada preferensi pribadi dan penggunaan keyboard. Misalnya, gamer mungkin lebih suka switch dengan waktu respon cepat, sedangkan pengetik mungkin lebih suka switch dengan umpan balik taktis yang baik.", "imageId": "fotoinfo/switches"},
    {"nama": "Stabilizer", "deskripsi": "Stabilizer adalah komponen keyboard yang digunakan untuk memberikan gerakan yang halus dan konsisten pada tombol yang lebih besar pada keyboard mekanik. Tombol-tombol ini termasuk spasi, shift, enter, dan tombol lainnya yang lebih panjang.\n\nBerikut adalah beberapa jenis stabilizer yang umum digunakan:\n\nStabilizer Mekanik: Stabilizer ini menggunakan mekanisme fisik untuk mendaftarkan keypress. Ada berbagai jenis stabilizer mekanik, termasuk Cherry MX, Gateron, Kailh, dan lainnya.\n\nStabilizer Membran: Stabilizer ini menggunakan lapisan karet atau silikon yang menciptakan sirkuit ketika tombol ditekan.\n\nStabilizer Topre: Ini adalah jenis stabilizer hybrid yang menggunakan kombinasi dari mekanisme mekanik dan karet.\n\nStabilizer Optik: Stabilizer ini menggunakan sinar cahaya untuk mendaftarkan keypress, yang membuatnya sangat cepat dan akurat.\n\nStabilizer Hall Effect: Stabilizer ini menggunakan medan magnet untuk mendaftarkan keypress, yang membuatnya sangat tahan lama dan akurat.\n\nPemilihan stabilizer sangat bergantung pada preferensi pribadi dan penggunaan keyboard. Misalnya, gamer mungkin lebih suka stabilizer dengan waktu respon cepat, sedangkan pengetik mungkin lebih suka stabilizer dengan umpan balik taktis yang baik.", "imageId": "fotoinfo/stabilizer"},
    {"nama": "Plate", "deskripsi": "Plate keyboard, atau biasa disebut plate, adalah komponen penting dalam keyboard mekanik yang berfungsi untuk menstabilkan switch dan keycaps. Plate berada di antara switch dan PCB (Printed Circuit Board) dan biasanya memiliki lubang di mana switch dipasang.\n\nBerikut adalah beberapa jenis material yang umum digunakan untuk plate keyboard:\n\nAluminium: Aluminium adalah material yang paling umum digunakan untuk plate karena kekuatan dan beratnya yang relatif ringan. Plate aluminium biasanya memberikan suara yang lebih tinggi dan lebih keras dibandingkan dengan material lain.\n\nBrass (Kuningan): Brass adalah material yang lebih berat dan biasanya memberikan suara yang lebih rendah dan lebih dalam. Brass juga cenderung lebih mahal dibandingkan dengan aluminium.\n\nStainless Steel: Stainless steel adalah material yang sangat kuat dan berat, dan biasanya memberikan suara yang sangat tinggi dan keras.\n\nPolycarbonate: Polycarbonate adalah jenis plastik yang kuat dan tahan lama. Plate polycarbonate biasanya memberikan suara yang lebih rendah dan lebih lembut dibandingkan dengan metal.\n\nPilihan material plate tergantung pada preferensi pribadi dan bagaimana Anda ingin keyboard Anda terdengar dan terasa.", "imageId": "fotoinfo/plate"},
    {"nama": "PCB", "deskripsi": "PCB merupakan suatu komponen yang memiliki fungsi seperti motherboard pada PC, dan tempat menaruh switch dan menghubungkan ke komponen lainnya.", "imageId": "fotoinfo/pcb"},
    {"nama": "Case", "deskripsi": "Untuk case terbagi kedalam beberapa jenis bahan seperti akrilik, plastik, alumunium, dan resin. ", "imageId": "fotoinfo/case"},
    {"nama": "Mounting Type", "deskripsi": "Mounting Type atau Mounting Style merupakan cara-cara untuk memasang seluruh komponen mekanikal keyboard", "imageId": "fotoinfo/mounting"}
]
