[
    {"nama": "Keycaps", "deskripsi": "Keycaps adalah tombol-tombol yang ada pada keyboard. Mereka adalah bagian yang kita tekan saat mengetik atau bermain game. Keycaps dapat dibuat dari berbagai jenis bahan, tetapi yang paling umum adalah plastik ABS dan PBT.\n\nABS (Acrylonitrile Butadiene Styrene) adalah jenis plastik yang umum digunakan dalam pembuatan keycaps. Keycaps ABS biasanya memiliki permukaan yang halus dan mengkilap, dan mereka cenderung menjadi lebih mengkilap seiring waktu dan penggunaan.\n\nPBT (Polybutylene Terephthalate) adalah jenis plastik lain yang digunakan dalam pembuatan keycaps. Keycaps PBT biasanya memiliki tekstur yang lebih kasar dibandingkan dengan ABS, dan mereka lebih tahan terhadap efek \"shine\" yang terjadi pada keycaps ABS seiring waktu.\n\nKeycaps juga dapat memiliki berbagai profil, yang merujuk pada bentuk dan ketinggian keycaps. Beberapa profil keycap yang populer termasuk OEM, Cherry, SA, DSA, dan XDA.\n\nSelain itu, keycaps juga bisa disesuaikan atau \"custom\". Keycaps custom memungkinkan pengguna untuk menyesuaikan tampilan dan nuansa keyboard mereka. Misalnya, Anda dapat membeli keycaps dengan tema tertentu, atau keycaps dengan karakter atau simbol khusus.\n\nSecara umum, keycaps adalah bagian penting dari keyboard yang tidak hanya berfungsi sebagai interface antara pengguna dan perangkat, tetapi juga memberikan estetika dan personalisasi pada keyboard.", "imageId": "fotoinfo/keycap"},
    {"nama": "Keyswitches", "deskripsi": "Switch dalam konteks keyboard adalah mekanisme yang mendaftarkan ketukan tombol atau keypress. Ada beberapa jenis switch yang umum digunakan pada keyboard, terutama pada keyboard mekanik:\n\nSwitch Mekanik: Ini adalah jenis switch yang paling umum ditemukan pada keyboard mekanik. Mereka menggunakan mekanisme fisik untuk mendaftarkan keypress. Ada berbagai jenis switch mekanik, termasuk Cherry MX, Gateron, Kailh, dan lainnya. Masing-masing memiliki karakteristik sendiri-sendiri, seperti tingkat kebisingan, berat keypress, dan umur hidup.\n\nSwitch Membran: Switch ini menggunakan lapisan karet atau silikon yang menciptakan sirkuit ketika tombol ditekan. Mereka biasanya lebih murah dan lebih tenang daripada switch mekanik, tetapi tidak memberikan umpan balik taktis yang sama.\n\nSwitch Topre: Ini adalah jenis switch hybrid yang menggunakan kombinasi dari mekanisme mekanik dan karet. Mereka dikenal karena umpan balik taktis mereka yang memuaskan dan harganya yang relatif mahal.\n\nSwitch Optik: Switch ini menggunakan sinar cahaya untuk mendaftarkan keypress, yang membuatnya sangat cepat dan akurat. Mereka juga cenderung memiliki umur hidup yang lebih lama daripada switch mekanik tradisional.\n\nSwitch Hall Effect: Switch ini menggunakan medan magnet untuk mendaftarkan keypress, yang membuatnya sangat tahan lama dan akurat. Namun, mereka juga cenderung lebih mahal daripada jenis switch lainnya.\n\nPemilihan switch sangat bergantung pada preferensi pribadi dan penggunaan keyboard. Misalnya, gamer mungkin lebih suka switch dengan waktu respon cepat, sedangkan pengetik mungkin lebih suka switch dengan umpan balik taktis yang baik.", "imageId": "fotoinfo/switches"},
    {"nama": "Stabilizer", "deskripsi": "Stabilizer adalah komponen keyboard yang digunakan untuk memberikan gerakan yang halus dan konsisten pada tombol yang lebih besar pada keyboard mekanik. Tombol-tombol ini termasuk spasi, shift, enter, dan tombol lainnya yang lebih panjang.\n\nBerikut adalah beberapa jenis stabilizer yang umum digunakan:\n\nStabilizer Mekanik: Stabilizer ini menggunakan mekanisme fisik untuk mendaftarkan keypress. Ada berbagai jenis stabilizer mekanik, termasuk Cherry MX, Gateron, Kailh, dan lainnya.\n\nStabilizer Membran: Stabilizer ini menggunakan lapisan karet atau silikon yang menciptakan sirkuit ketika tombol ditekan.\n\nStabilizer Topre: Ini adalah jenis stabilizer hybrid yang menggunakan kombinasi dari mekanisme mekanik dan karet.\n\nStabilizer Optik: Stabilizer ini menggunakan sinar cahaya untuk mendaftarkan keypress, yang membuatnya sangat cepat dan akurat.\n\nStabilizer Hall Effect: Stabilizer ini menggunakan medan magnet untuk mendaftarkan keypress, yang membuatnya sangat tahan lama dan akurat.\n\nPemilihan stabilizer sangat bergantung pada preferensi pribadi dan penggunaan keyboard. Misalnya, gamer mungkin lebih suka stabilizer dengan waktu respon cepat, sedangkan pengetik mungkin lebih suka stabilizer dengan umpan balik taktis yang baik.", "imageId": "fotoinfo/stabilizer"},
    {"nama": "Plate", "deskripsi": "Plate keyboard, atau biasa disebut plate, adalah komponen penting dalam keyboard mekanik yang berfungsi untuk menstabilkan switch dan keycaps. Plate berada di antara switch dan PCB (Printed Circuit Board) dan biasanya memiliki lubang di mana switch dipasang.\n\nBerikut adalah beberapa jenis material yang umum digunakan untuk plate keyboard:\n\nAluminium: Aluminium adalah material yang paling umum digunakan untuk plate karena kekuatan dan beratnya yang relatif ringan. Plate aluminium biasanya memberikan suara yang lebih tinggi dan lebih keras dibandingkan dengan material lain.\n\nBrass (Kuningan): Brass adalah material yang lebih berat dan biasanya memberikan suara yang lebih rendah dan lebih dalam. Brass juga cenderung lebih mahal dibandingkan dengan aluminium.\n\nStainless Steel: Stainless steel adalah material yang sangat kuat dan berat, dan biasanya memberikan suara yang sangat tinggi dan keras.\n\nPolycarbonate: Polycarbonate adalah jenis plastik yang kuat dan tahan lama. Plate polycarbonate biasanya memberikan suara yang lebih rendah dan lebih lembut dibandingkan dengan metal.\n\nPilihan material plate tergantung pada preferensi pribadi dan bagaimana Anda ingin keyboard Anda terdengar dan terasa.", "imageId": "fotoinfo/plate"},
    {"nama": "PCB", "deskripsi": "PCB (Printed Circuit Board) pada keyboard mekanik memang berfungsi seperti motherboard pada PC. PCB adalah papan sirkuit tempat komponen keyboard mekanik seperti switch, LED, dan lainnya ditempatkan dan disolder. PCB juga bertugas menghubungkan semua komponen tersebut sehingga dapat berfungsi bersama-sama.\n\nBerikut adalah beberapa fungsi utama PCB pada keyboard mekanik:\n1. Menyediakan Jalur Sirkuit: PCB menyediakan jalur sirkuit untuk menghubungkan switch, LED, dan komponen lainnya. Jalur ini memungkinkan arus listrik mengalir dari satu komponen ke komponen lainnya.\n2. Mendukung Komponen: PCB memberikan dukungan fisik untuk komponen keyboard. Komponen seperti switch dan LED ditempatkan dan disolder langsung ke PCB.\n3. Menghubungkan Komponen: PCB menghubungkan semua komponen keyboard mekanik bersama-sama. Ini memungkinkan komponen untuk berkomunikasi satu sama lain dan bekerja bersama-sama untuk membuat keyboard berfungsi.\n4. Mendukung Fungsi Tambahan: Beberapa PCB keyboard mekanik juga mendukung fungsi tambahan seperti pencahayaan latar LED, konektivitas nirkabel, dan pemrograman kunci kustom.\n\nDalam beberapa kasus, Anda mungkin menemukan keyboard mekanik dengan PCB hot-swappable, yang memungkinkan Anda untuk mengganti switch tanpa perlu soldering. Ini memberikan fleksibilitas lebih dalam menyesuaikan keyboard Anda. Selain itu, beberapa PCB juga dilengkapi dengan fitur seperti dukungan untuk pemrograman kunci kustom dan pencahayaan latar LED.\n", "imageId": "fotoinfo/pcb"},
    {"nama": "Case", "deskripsi": "Case keyboard mekanik adalah penutup pelindung yang menampung komponen internal keyboard mekanik. Case memberikan perlindungan dan nilai estetika pada keyboard, dan dapat dibuat dari berbagai jenis bahan.\n\nBerikut adalah beberapa jenis bahan yang umum digunakan untuk case keyboard mekanik:\n1. Plastik: Plastik adalah bahan yang paling umum digunakan untuk case keyboard mekanik. Case plastik biasanya lebih ringan dan lebih murah dibandingkan dengan bahan lainnya.\n2. Akrilik: Case akrilik biasanya transparan, memungkinkan Anda melihat komponen internal keyboard. Akrilik juga dapat memberikan efek pencahayaan yang menarik jika keyboard Anda dilengkapi dengan LED.\n3. Aluminium: Aluminium adalah bahan yang populer untuk case keyboard mekanik kelas atas. Case aluminium biasanya lebih berat dan lebih kuat dibandingkan dengan case plastik atau akrilik, dan dapat memberikan suara mengetik yang lebih solid.\n4. Resin: Resin adalah bahan yang dapat dicetak menjadi berbagai bentuk dan warna, membuatnya ideal untuk case keyboard mekanik kustom.\n5. Kayu: Case kayu memberikan tampilan dan perasaan yang unik dan hangat pada keyboard Anda. Kayu juga dapat membantu meredam suara mengetik.\n\nPemilihan bahan case tergantung pada preferensi pribadi Anda, termasuk berat yang Anda inginkan, suara mengetik, dan estetika keyboard. Selalu disarankan untuk mencoba beberapa jenis bahan case sebelum memutuskan yang terbaik untuk Anda.\n", "imageId": "fotoinfo/case"},
    {"nama": "Mounting Type", "deskripsi": "Mounting Style atau Mounting Type pada keyboard mekanik merujuk pada cara bagaimana papan sirkuit (PCB) atau pelat dipasang dalam casing keyboard. Ada beberapa jenis mounting style yang umum digunakan dalam keyboard mekanik:\n\n1. Tray Mount: Tray Mount adalah teknik yang memasang PCB ke bagian bawah casing keyboard. PCB ditahan dengan sekrup, mendorong PCB ke arah tray di bawah keyboard.\n2. Plate Mount: Plate Mount melibatkan pembuatan frame atas dan pelat menjadi satu bagian, sehingga tidak memerlukan pengencang tambahan.\n3. Plateless (PCB Mount): Dalam metode ini, switch dipasang langsung ke PCB alih-alih pelat.\n4. Sandwich Mount: Sekrup melewati casing bawah, pelat, dan casing atas keyboard, menahan pelat seperti isi sandwich.\n5. Bottom Mount: Sebagai kebalikan dari Top Mount, Bottom Mount memasang pelat ke casing bawah keyboard.\n6. Integrated Plate: Integrated Plate berarti pelat dan casing atas keyboard diproduksi sebagai satu bagian. Ini memberikan keyboard perasaan yang sangat kaku dan solid.\n7. Gasket Mount: Gasket Mount menggunakan material gasket antara pelat dan casing keyboard di kedua sisi atas dan bawah. Ini memberikan keyboard perasaan yang sedikit lebih empuk karena pelat tidak berkontak langsung dengan komponen logam lainnya dari keyboard.\n\nPilihan mounting style akan sangat mempengaruhi pengalaman menggunakan keyboard. Pilihan Anda dalam layout, pelat, switch, dan modifikasi dapat meningkatkan atau berpotensi mengurangi kualitas inheren dari mount. Misalnya, gasket mount dengan pelat kuningan akan jauh lebih kaku dibandingkan sandwich mount dengan pelat polikarbonat. Mencoba berbagai papan dan komponen keyboard adalah kunci dalam menciptakan build yang tepat untuk Anda dalam hobi di mana preferensi adalah raja.", "imageId": "fotoinfo/mounting"}
]
