[
    {"namaT": "Keyswitch Lube", "imageIdT": "fototutor/lubeswitch", 
	"penjelasan": "Melumasi keyswitch keyboard mekanik dapat membuat keyboard Anda lebih halus dan nyaman saat digunakan. Berikut adalah langkah-langkah untuk melumasi keyswitch keyboard mekanik:\n\n1. **Lepaskan Switch dari Keyboard**: Jika keyboard Anda adalah tipe hot swappable, Anda bisa langsung melepas switchnya. Jika bukan, Anda mungkin perlu melakukan soldering untuk melepas switch.\n2. Buka Switch: Gunakan switch opener untuk membuka switch.\n3. Lumasi Bagian Dalam Switch**: Gunakan kuas kecil untuk melumasi bagian dalam switch. Lumasi bagian slider kiri dan kanan bagian dalam, serta lubangnya.\n4. Lumasi Per: Lumasi per dengan pelumas.\n5. Lumasi Bagian Bawah dan Atas Housing: Lumasi bagian bawah dan atas housing.\n6. Pasang Kembali Switch: Setelah semua bagian telah dilumasi, pasang kembali switch.\n7. Pasang Kembali Switch ke Keyboard: Pasang kembali switch yang telah dilumasi ke keyboard Anda.\n\nUntuk pelumas, KRYTOX 204G0 direkomendasikan untuk switch tactile seperti blue switch dan brown switch, sedangkan KRYTOX 205G0 direkomendasikan untuk switch linear seperti red switch dan yellow switch.\n",
	"linkEmb":"https://www.youtube.com/embed/vkpg_Hozub8?si=-tl6mjC416moDELH&amp;start=684"},
	{"namaT": "Holee Mod", "imageIdT": "fototutor/holeemod",
	"penjelasan": "Holee Mod adalah modifikasi keyboard yang melibatkan penempatan plester kain di batang stabilizer. Ini menghasilkan stabilizer yang terasa lebih halus. Berikut adalah langkah-langkah dasar untuk melakukan Holee Mod pada stabilizer keyboard mekanik:\n\n1. **Bongkar Stabilizer**: Lepaskan stabilizer dari keyboard Anda. Pastikan untuk berhati-hati agar tidak merusak bagian lain dari keyboard.\n2. Pembersihan Stabilizer: Bersihkan stabilizer Anda. Ini penting untuk memastikan bahwa tidak ada debu atau kotoran yang bisa mengganggu proses modifikasi.\n3. Pemotongan Plester: Potong plester kain menjadi ukuran yang sesuai. Ukurannya harus cukup kecil untuk muat di dalam batang stabilizer.\n4. Pemasangan Plester: Tempelkan plester kain ke dalam batang stabilizer. Pastikan plester menempel dengan baik dan tidak mengganggu gerakan batang stabilizer.\n5. Pelumasan Stabilizer: Olesi stabilizer dengan pelumas. Ini akan membantu memperhalus gerakan stabilizer dan mengurangi suara berisik.\n6. Pemasangan Kembali Stabilizer: Pasang kembali stabilizer ke keyboard Anda. Pastikan untuk memeriksa apakah semua bagian berfungsi dengan baik sebelum Anda mulai mengetik.\n",
	"linkEmb":"https://www.youtube.com/embed/-vhpHjlkRgQ?si=kS1vhckC4qFaCsxB&amp;start=168"},
	{"namaT": "Bag lube springs", "imageIdT": "fototutor/baglube", 
	"penjelasan": "Bag lubing adalah metode yang efisien untuk melumasi per keyswitch keyboard mekanik. Berikut adalah langkah-langkahnya:\n\n1. Buka Switch: Gunakan switch opener untuk membuka switch.\n2. Siapkan Per: Setelah switch terbuka, pisahkan per dari bagian lainnya.\n3. Siapkan Kantong Plastik atau Wadah: Masukkan semua per ke dalam kantong plastik atau wadah plastik.\n4. Tambahkan Pelumas: Tambahkan pelumas ke dalam kantong atau wadah. Krytox 105 oil adalah pelumas yang paling umum digunakan untuk bag lubing, berikan 5-10 tetes.\n5. Kocok: Tutup kantong atau wadah, lalu kocok dengan energik.\n6. Pasang Kembali Per ke Switch: Setelah semua per telah dilumasi, pasang kembali per ke dalam switch.\n7. Pasang Kembali Switch ke Keyboard: Pasang kembali switch yang telah dilumasi ke keyboard Anda.\n",
	"linkEmb":"https://www.youtube.com/embed/lkMxroMs32Y?si=9S8WKhOm2wrmNvaz"}
]
